{
  "lines": [
    {
      "id": "bb818ddf-14a4-437f-b745-a87653e600bc",
      "Arabic": "بسم الله الرحمن الرحيم",
      "English": "In the name of Allah, the Most Beneficent, the Most Merciful.",
      "commentary": "None",
      "rootwords": "None"
    },
    {
      "id": "aabc25fa-7dc5-4822-98f7-2b7cbc70ee05",
      "Arabic": "صلى الله على سيدنا محمّد وعلى آله وصحبه وسلّم",
      "English": "Peace and Blessings be upon our Master Muhammad, and upon his family and companions.",
      "commentary": "None",
      "rootwords": "None"
    },
    {
      "id": "c3b13d53-1ff5-47a1-82c1-c7b00ce540fd",
      "Arabic": "المقدمة الأولى: في الأحكام",
      "English": "Preliminary 1: Judgments",
      "commentary": "None",
      "rootwords": "None"
    },
    {
      "id": "a7606744-3584-4819-997b-2e62b7131927",
      "Arabic": "قال الشّيخ الإمام العالم العلاّمة المحقّق أبو عبد الله محمّد السّنوسي الحسني رحمه الله تعالى: ",
      "English": "The Shaykh, Imam, Expert, Abu Abdullah Muhammad Al-Sanusi Al-Hassani, may Allah have mercy on him said:",
      "commentary": "None",
      "rootwords": "None"
    },
    {
      "id": "a903f3b5-2bf5-4e40-acd9-dfd101ba546a",
      "Arabic": "الحمد لله ",
      "English": "All praise is due to Allah.",
      "commentary": "None",
      "rootwords": "None"
    },
    {
      "id": "be72269d-5dfe-4b35-9a21-eeb24601248e",
      "Arabic": "الحكم إثبات أمر أو نفيه.",
      "English": "A judgment is the affirmation of a matter, or its negation.",
      "commentary": "The purpose of this preliminary is to establish a paradigm through which the rest of the Divine Law can be understood. This preliminary has ties to every science. All knowledge of creations , secular and religious, can be divided into two categories: concepts and propositions made out of those concepts. For example, “human” is a concept. “Humans have bodies” is a proposition. A proposition and a judgement are synonyms.  The reason a proposition is called a judgement is because you are judging the subject of the proposition by the predicate. You are judging, or affirming, “humans” to have bodies. Likewise, I can judge through negation, such as saying “the universe did not create itself”. All of our knowledge is divided in this way. Out of these, Imam Al-Sanusi mentions three of the types of propositions that are used in the majority of discussions related to Aqida, Usul-ul-Fiqh, and Fiqh. ",
      "rootwords": "None"
    }
  ]
}